{"chats":["First chat, hard coded","\"test2\"","seems to be working now","hey there","well hello!","¯\\_(ツ)_/¯","Seems like adding timestamps and optional name would be good?\n","This page is constantly reloading for me in Chrome, working in Firefox though","yeah\nalso is multiline necessary?","it'd be nice to press enter to submit","message test test","the reloading happens if you opened this tab from the Glitch editor. Tabs can control the other tabs they open. Copy/paste the URL into a new tab and it won't auto-refresh.","right! forgot that","can i submit?","Any feelings on the mousetail animation style? I just commented some stuff out at https://glitch.com/edit/#!/the-most-collaborative-website?path=public/style.css:51:0 and set https://glitch.com/edit/#!/the-most-collaborative-website?path=script/mousetail.js:9:5 back to 5, to make it stay closer to the cursor, without the delay. Prefer the delay?","oops made it too small","The delay was there so you can click on it, but I would like to have it be more responsive","perhaps we could make option + click (on anything) cycle the emoji?","can we change from a debounce to a rate limit so it doesn't get stuck if you move too much?","Imma try that and see how it goes","sure","also the chat hopefully won't reload anymore","there we go!","new to the flexbox thing, if anyone wants knows how to get the submit form above the list that seems helpful","does this seem upside down to y'all? 🙃","Was thinking when it gets long it will be easier to see new things",{"message":"Was thinking when it gets long it will be easier to see new things","timestamp":1495591003775},"test",{"message":"test","timestamp":1495591172029},{"message":"Timestamps should work now without double messages","timestamp":1495591298605},{"message":"test","timestamp":"2:09"},{"message":"Now with GMT timestamps","timestamp":"2:10 GMT"},{"message":"hey, nice!","timestamp":"2:11 GMT"},{"message":"it'd be great if we could make this work without re-rendering the whole chat to add new messages","timestamp":"2:11 GMT"},{"message":"makes inspecting stuff in devtools tricky as-is","timestamp":"2:11 GMT"},{"message":"Haha, that would be great, this was MVP because I wasn't sure the .json file hack would work on Glitch","timestamp":"2:11 GMT"},{"message":"good MVP!","timestamp":"2:12 GMT"},{"message":"should we use Socket.io for this second version? They have a very nice how-to... which happens to be for writing a chat application! https://socket.io/get-started/chat/","timestamp":"2:22 GMT"},{"message":"makes sense!","timestamp":"2:23 GMT"},{"message":"Don't have experience with it though, I also don't have much more time tonight","timestamp":"2:23 GMT"},{"message":"hola","timestamp":"2:25 GMT"},{"message":"hi, how can I unsuscribe to this glitch?","timestamp":"2:25 GMT"},{"message":"hola!","timestamp":"2:28 GMT"},{"message":"Not sure how you can leave","timestamp":"2:29 GMT"},{"message":"Hm, I'm not sure if they've implemented a way to remove yourself from a Glitch project yet. ","timestamp":"2:31 GMT"},{"message":"Beta chat channel working for testing things without breaking chat: https://the-most-collaborative-website.glitch.me/chat/beta","timestamp":"2:34 GMT"},{"message":"I'm getting off for the night but going to look into socket.io for new version also","timestamp":"2:35 GMT"},{"message":"Also just noticed enter to submit works! 🦄","timestamp":"2:36 GMT"}]}
